Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་མི་དམིགས་སོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་བདག་མེད་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are not a self they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བདག་མེད་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are not a self they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་ཞི་བའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are at peace they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞི་བའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are at peace they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་སྟོང་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are empty they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྟོང་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are empty they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་མཚན་མ་མེད་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are signless they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མཚན་མ་མེད་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are signless they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་སྨོན་པ་མེད་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are wishless they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྨོན་པ་མེད་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are wishless they do not apprehend that.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྣམ་པར། རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are unconditioned they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ། མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are unconditioned they do not apprehend that.

source: དེ་མི་དམིགས་སོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་དབེན་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that physical forms are void they do not apprehend that.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དབེན་པའི་རྣམ་པར་རྟོག་པར་བྱེད་དེ། དེ་མི་དམིགས་སོ།
en: Because they focus their attention with all-aspect omniscience in mind, while they discern that feelings, perceptions, formative predispositions, and consciousness are void they do not apprehend that.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་རྟོག་པ་དེ་འདི་སྙམ་དུ་སེམས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ལ་གཟུགས་མི་རྟག་ཅེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་བསྟན་ཏོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: Subhūti, bodhisattva great beings, keeping that reflection in mind, teach to all beings the doctrine that physical forms are impermanent by way of not apprehending it, and teach the doctrine that feelings, perceptions, formative predispositions, and consciousness are impermanent, by way of not apprehending it.

source: རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་བསྟན་ཏོ། །གཟུགས་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་བ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་བསྟན་ཏོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: They teach the doctrine that physical forms are imbued with suffering, without a self, at peace, empty, signless, wishless, unconditioned, and void, by way of not apprehending it; and they teach the doctrine that feelings, perceptions, formative predispositions, and consciousness are imbued with suffering, without a self, at peace, empty, signless, wishless, unconditioned, and void, by way of not apprehending it.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་ཞེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་བསྟན་ཏོ་སྙམ་མོ། །རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉམས་པ་མེད་པ་སྟེ།
en: This, Subhūti, is the undiminished perfection of generosity that bodhisattva great beings have.

source: དེ་ཡོད་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་འཇིགས། མི་སྔང་སྐྲག་པར་མི་འགྱུར་རོ།
en: By having it, bodhisattva great beings will not be afraid, fearful, or terrified. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བྱ་བ་དང་མི་ལྡན་པས། གཟུགས་གང་མི་རྟག་པའི་རྣམ་པར་ཡིད་ལ་བྱེད་པ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡིད་ལ་བྱེད་དོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, since the direction of their attention is not that of śrāvakas or pratyekabuddhas, they focus their attention on the impermanent aspect of physical forms but do so by way of not apprehending it.

source: །ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བྱ་བ་དང་མི་ལྡན་པས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་པའི་རྣམ་པར་ཡིད་ལ་བྱེད་པ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡིད་ལ་བྱེད་དོ།
en: Since the direction of their attention is not that of śrāvakas or pratyekabuddhas, they focus their attention on the impermanent aspect of feelings, perceptions, formative predispositions, and consciousness but do so by way of not apprehending it.

source: །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བྱ་བ་དང་མི་ལྡན་པས། གཟུགས་གང་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་།
en: Since the direction of their attention is not that of śrāvakas or pratyekabuddhas, they focus their attention on the aspect by which physical forms are imbued with suffering, without a self, at peace, empty, signless, wishless, unconditioned, and void, but do so by way of not apprehending it.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་པའི་རྣམ་པར་ཡིད་ལ་བྱེད་པ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡིད་ལ་བྱེད་དོ། །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པ་དང་། ཞི་བ་དང་། སྟོང་པ་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་།
en: Since the direction of their attention is not that of śrāvakas or pratyekabuddhas, they focus their attention on the aspect by which feelings, perceptions, formative predispositions, and consciousness are imbued with suffering, without a self, at peace, empty, signless, wishless, unconditioned, and void, but do so by way of not apprehending it.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། དབེན་པའི་རྣམ་པར་ཡིད་ལ་བྱེད་པ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཡིད་ལ་བྱེད་དོ། །རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉམས་པ་མེད་པ་སྟེ།
en: This, Subhūti, is the undiminished perfection of ethical discipline that bodhisattva great beings have.

source: དེ་ཡོད་པས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་འཇིགས་མི་དངང་སྐྲག་པར་མི་འགྱུར་རོ།
en: By possessing this, bodhisattva great beings will not be afraid, fearful, or terrified. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་དེ་དག་ལ་མི་རྟག་པའི་རྣམ་པ་དང་། སྡུག་བསྔལ་བའི་རྣམ་པ་དང་། བདག་མེད་པའི་རྣམ་པ་དང་། ཞི་བའི་རྣམ་པ་དང་། སྟོང་པ་ཉིད་ཀྱི་རྣམ་པ་དང་། མཚན་མ་མེད་པའི་རྣམ་པ་དང་། སྨོན་པ་མེད་པའི་རྣམ་པ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they discern, are receptive to, and observe that all those phenomena are impermanent, imbued with suffering, not a self, at peace, empty, signless, wishless, unconditioned, and void.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྣམ་པ་དང་། དབེན་པའི་རྣམ་པར་རྟོག་པར་བྱེད་པ་དང་། བཟོད་པ་དང་། མོས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: This is the perfection of tolerance that bodhisattva great beings have.

source: དེ་ཡོད་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མི་འཇིགས་མི་དངང་། སྐྲག་པར་མི་འགྱུར་རོ།
en: By having it, bodhisattva great beings will not be afraid, fearful, or terrified. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་མི་རྟག་ཅེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རབ་ཏུ་རྟོག་གོ །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རབ་ཏུ་རྟོག་གོ །
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, because they focus their attention with all-aspect omniscience in mind they discern that physical forms are impermanent, by way of not apprehending it; they also discern that feelings, perceptions, formative predispositions, and consciousness are impermanent, by way of not apprehending it.

source: གཟུགས་སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་ཅེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རབ་ཏུ་རྟོག་གོ །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བ་དང་།
en: They discern that physical forms are imbued with suffering, that they are not a self, that they are at peace, that they are empty, that they are signless, that they are wishless, that they are unconditioned, and that they are void, by way of not apprehending it.

source: སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་།
en: They discern that feelings, perceptions, formative predispositions, and consciousness are impermanent, that they are imbued with suffering, that they are not a self, that they are at peace, that they are empty, that they are signless, that they are wishless, that they are unconditioned, and that they are void, by way of not apprehending it.

source: མངོན་པར་འདུ་བྱ་བ་མེད་ཅེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རབ་ཏུ་རྟོག་གོ །དེ་ལྟར་དེ་དག་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་མི་གཏོང་ཞིང་། བརྩོན་འགྲུས་མི་འདོར་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: Not to give up focusing their attention with all-aspect omniscience in mind and not to forsake perseverance is the bodhisattva great beings’ perfection of perseverance.

source: དེ་ཡོད་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་མི་འཇིགས། མི་དངང་སྐྲག་པར་མི་འགྱུར་རོ།
en: By having it, bodhisattva great beings will not be afraid, fearful, or terrified. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། གཟུགས་མི་རྟག་ཅེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྟོག་ཅིང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་། མི་དགེ་བའི་ཆོས་དེ་མ་ཡིན་པ་བྱང་ཆུབ་ཀྱི་གེགས་སུ་འགྱུར་བ་གཞན་གྱི་སྐབས་མི་འབྱེད་པ་དང་། གཟུགས་སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, because they focus their attention with all-aspect omniscience in mind they discern that physical forms are impermanent by way of not apprehending it, and deny any opportunity for the ways śrāvakas and pratyekabuddhas direct their attention, or for other nonvirtuous actions apart from those, to impede the attainment of enlightenment.

source: མངོན་པར་འདུ་བྱ་བ་མེད་ཅེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྟོག་ཅིང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་། མི་དགེ་བ་དེ་མ་ཡིན་པ་བྱང་ཆུབ་ཀྱི་གེགས་སུ་འགྱུར་བ་གཞན་གྱི་གོ་མི་འབྱེད་པ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བ་དང་། སྡུག་བསྔལ་ཞེས་བྱ་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། ཞི་ཞེས་བྱ་བ་དང་། སྟོང་ཞེས་བྱ་བ་དང་། མཚན་མ་མེད་ཅེས་བྱ་བ་དང་། སྨོན་པ་མེད་ཅེས་བྱ་བ་དང་།
en: They discern that physical forms are imbued with suffering, that they are not a self, that they are at peace, that they are empty, that they are signless, that they are wishless, that they are unconditioned, and that they are void, by way of not apprehending it, and deny any opportunity for the ways śrāvakas and pratyekabuddhas direct their attention, or for other nonvirtuous actions apart from those, to impede the attainment of enlightenment.

source: མངོན་པར་འདུ་བྱ་བ་མེད་ཅེས་བྱ་བ་དང་། དབེན་ཞེས་བྱ་བར་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་རྟོག་ཅིང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་། མི་དགེ་བ་དེ་མ་ཡིན་པ་བྱང་ཆུབ་ཀྱི་གེགས་སུ་འགྱུར་བ་གཞན་གྱི་གོ་མི་འབྱེད་པ་འདི་ནི།
en: They discern that feelings, perceptions, formative predispositions, and consciousness are impermanent, that they are imbued with suffering, that they are not a self, that they are at peace, that they are empty, that they are signless, that they are wishless, that they are unconditioned, and that they are void, by way of not apprehending it, and deny any opportunity for the ways śrāvakas and pratyekabuddhas direct their attention, or for other nonvirtuous actions apart from those, to impede the attainment of enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: This is the perfection of meditative concentration that bodhisattva great beings have.

source: དེ་ཡོད་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་མི་འཇིགས་མི་དངང་སྐྲག་པར་མི་འགྱུར་རོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཅུ་གཉིས་པ།
en: By having it, bodhisattva great beings will not be afraid, fearful, or terrified. “

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་རྣམ་པ་འདི་ལྟར་རབ་ཏུ་རྟོག་སྟེ། གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ཀྱིས་གཟུགས་སྟོང་པ་མ་ཡིན་གྱི། གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, because they focus their attention with all-aspect omniscience in mind they discern that physical forms are not empty of the emptiness of physical forms, but that the nature of physical forms is emptiness, and that emptiness is indeed physical forms. [

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་ཀྱིས། རྣམ་པར་ཤེས་པ་སྟོང་པ་མ་ཡིན་གྱི། རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ།
en: They discern] that consciousness [and the other aggregates] are not empty of the emptiness of feelings, perceptions, formative predispositions, or consciousness, but that the nature of consciousness [and so forth] is emptiness, and that emptiness is indeed consciousness [and so forth]. [

source: །མིག་གི་སྟོང་པ་ཉིད་ཀྱིས་མིག་སྟོང་པ་མ་ཡིན་གྱི། མིག་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་མིག་གོ །རྣ་བ་དང་། སྣ་དང་།
en: They discern] that the eyes are not empty of the emptiness of the eyes, but that the nature of the eyes is emptiness, and that emptiness is indeed the eyes. [

source: ལྕེ་དང་། ལུས་དང་། ཡིད་ཀྱི་སྟོང་པ་ཉིད་ཀྱིས། ཡིད་སྟོང་པ་མ་ཡིན་གྱི། ཡིད་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་ཡིད་དོ།
en: They discern] that the mental faculty [and so forth] are not empty of the emptiness of the ears, nose, tongue, body, or mental faculty, but that the nature of the mental faculty [and so forth] is emptiness, and that emptiness is indeed the mental faculty [and so forth]. [

source: གཟུགས་ཀྱི་སྟོང་པ་ཉིད་ཀྱིས་གཟུགས་སྟོང་པ་མ་ཡིན་གྱི། གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ། །སྒྲ་དང་།
en: They discern] that sights are not empty of the emptiness of sights, but that the nature of sights is emptiness, and that emptiness is indeed sights. [

source: དྲི་དང་། རོ་དང་། རེག་དང་། ཆོས་ཀྱི་སྟོང་པ་ཉིད་ཀྱིས། ཆོས་སྟོང་པ་མ་ཡིན་གྱི། ཆོས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ།
en: They discern] that mental phenomena [and so forth] are not empty of the emptiness of sounds, odors, tastes, tangibles, or mental phenomena, but that the nature of mental faculty [and so forth] is emptiness, and that emptiness is indeed mental phenomena [and so forth]. [

source: །སྟོང་པ་ཉིད་ཀྱང་ཆོས་སོ། །མིག་གི་རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་ཀྱིས། མིག་གི་རྣམ་པར་ཤེས་པ་སྟོང་པ་མ་ཡིན་གྱི། མིག་གི་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་མིག་གི་རྣམ་པར་ཤེས་པའོ། །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་།
en: They discern] that visual consciousness is not empty of the emptiness of visual consciousness, but that the nature of visual consciousness is emptiness, and that emptiness is indeed visual consciousness. [

source: སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་སྟོང་པ་ཉིད་ཀྱིས། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་སྟོང་པ་མ་ཡིན་གྱི། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའོ།
en: They discern] that mental consciousness [and so forth] are not empty of the emptiness of auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, or mental consciousness, but that the nature of mental consciousness [and so forth] is emptiness, and that emptiness is indeed mental consciousness [and so forth]. [

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་སྟོང་པ་ཉིད་ཀྱིས། མིག་གི་འདུས་ཏེ་རེག་པ་སྟོང་པ་མ་ཡིན་གྱི། མིག་གི་འདུས་ཏེ་རེག་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་མིག་གི་འདུས་ཏེ་རེག་པའོ། །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་།
en: They discern] that visually compounded sensory contact is not empty of the emptiness of visually compounded sensory contact, but that the nature of visually compounded sensory contact is emptiness, and that emptiness is indeed visually compounded sensory contact. [

source: སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་སྟོང་པ་ཉིད་ཀྱིས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་སྟོང་པ་མ་ཡིན་གྱི།
en: They discern] that mentally compounded sensory contact [and so forth] are not empty of the emptiness of aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, or mentally compounded sensory contact, but that the nature of mentally compounded sensory contact [and so forth] is emptiness, and that emptiness is indeed mentally compounded sensory contact [and so forth]. [

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའོ། །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་སྟོང་པ་ཉིད་ཀྱི། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་པ་མ་ཡིན་གྱི། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱི
en: They discern] that feelings conditioned by visually compounded sensory contact is not empty of the emptiness of feelings conditioned by visually compounded sensory contact, but that the nature of feelings conditioned by visually compounded sensory contact is emptiness, and that emptiness is indeed feelings conditioned by visually compounded sensory contact. [

source: ས་ཚོར་བའོ། །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་སྟོང་པ་ཉིད་ཀྱིས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྟོང་པ་མ་ཡིན་གྱིས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའོ།
en: They discern] that feelings conditioned by mentally compounded sensory contact [and so forth] are not empty of the emptiness of feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, or feelings conditioned by mentally compounded sensory contact, but that the nature of feelings conditioned by mentally compounded sensory contact [and so forth] is emptiness, and that emptiness is indeed feelings conditioned by mentally compounded sensory contact [and so forth]. “[

source: །དྲན་པ་ཉེ་བར་གཞག་པའི་བར་གྱི་སྟོང་པ་ཉིད་ཀྱིས། དྲན་པ་ཉེ་བར་གཞག་པ་སྟོང་པ་མ་ཡིན་གྱི། དྲན་པ་ཉེ་བར་གཞག་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པའོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའི་བར་གྱི་སྟོང་པ་ཉིད་ཀྱིས།
en: They discern] that the applications of mindfulness are not empty of the emptiness of the applications of mindfulness, but that the nature of the applications of mindfulness is emptiness, and that emptiness is indeed the applications of mindfulness. [

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་སྟོང་པ་མ་ཡིན་གྱི། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ། །སྟོང་པ་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའོ།
en: They discern] that the distinct qualities of the buddhas [and the other causal and fruitional attributes] are not empty of the emptiness of the distinct qualities of the buddhas [and so forth], but that the nature of the distinct qualities of the buddhas [and so forth] is emptiness, and that emptiness is indeed the distinct qualities of the buddhas [and so forth].

source: །རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ། རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཐབས་མཁས་པའོ།
en: This, Subhūti, is the skillful means of bodhisattva great beings who practice the perfection of wisdom. {

source: །ཐབས་མཁས་པ་དེ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསྟན་པ་འདི་ཐོས་ན། མི་འཇིགས་མི་དངང་སྐྲག་པར་མི་འགྱུར་རོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: Dt.156} Bodhisattva great beings who possess this skillful means will not be afraid, fearful, or terrified on hearing this teaching.”

source: བཅོམ་ལྡན་འདས་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྟན་པ་འདི་ཐོས་ན། མི་འཇིགས་མི་དངང་། སྐྲག་པར་མི་འགྱུར་བའི་དགེ་བའི་བཤེས་གཉེན་དེ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Subhūti then asked, “Blessed Lord, who are the spiritual mentors by whom bodhisattva great beings are accepted and through whom they will not be afraid, fearful, or terrified on hearing this teaching?” “
